{"id":322,"date":"2022-02-27T12:12:31","date_gmt":"2022-02-27T12:12:31","guid":{"rendered":"http:\/\/localhost\/pas\/?p=322"},"modified":"2022-04-23T09:01:51","modified_gmt":"2022-04-23T02:01:51","slug":"nam-vung-kien-thuc-trong-nganh-khoa-hoc-may-tinh","status":"publish","type":"post","link":"http:\/\/localhost\/pas\/2022\/02\/27\/nam-vung-kien-thuc-trong-nganh-khoa-hoc-may-tinh\/","title":{"rendered":"N\u0102M V\u00d9NG KI\u1ebeN TH\u1ee8C TRONG NG\u00c0NH KHOA H\u1eccC M\u00c1Y\u00a0T\u00cdNH"},"content":{"rendered":"\n<figure class=\"wp-block-embed aligncenter is-type-rich is-provider-spotify wp-block-embed-spotify\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Spotify Embed: N\u0102M V\u00d9NG KI\u1ebeN TH\u1ee8C TRONG NG\u00c0NH KHOA H\u1eccC M\u00c1Y T\u00cdNH\" style=\"border-radius: 12px\" width=\"100%\" height=\"152\" frameborder=\"0\" allowfullscreen allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" src=\"https:\/\/open.spotify.com\/embed\/episode\/4u67xKmaBgglct5vQrqVqQ?go=1&#038;sp_cid=6e7f8a7c-5bc9-435a-8bc8-91440832560a&#038;utm_source=oembed&#038;utm_medium=desktop&#038;nd=1\"><\/iframe>\n<\/div><\/figure>\n\n\n\n<p class=\"has-drop-cap has-medium-font-size\">Ng\u00e0nh khoa h\u1ecdc m\u00e1y t\u00ednh c\u00f3 th\u1ec3 chia th\u00e0nh 5 lo\u1ea1i v\u00f9ng kh\u00e1i ni\u1ec7m (ph\u1ea7n ch\u00ednh) c\u1ee7a ng\u00e0nh h\u1ecdc:<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>H\u1ec7 th\u1ed1ng t\u00ednh to\u00e1n<\/strong><\/p>\n\n\n\n<ul class=\"has-medium-font-size\"><li>H\u1ec7 th\u1ed1ng t\u00ednh to\u00e1n l\u00e0 ph\u1ea7n m\u00e1y ch\u1ea1y ch\u01b0\u01a1ng tr\u00ecnh v\u00e0 x\u1eed l\u00fd th\u00f4ng tin.<\/li><\/ul>\n\n\n\n<p class=\"has-medium-font-size\">V\u00ed d\u1ee5: m\u00e1y vi t\u00ednh, \u0111i\u1ec7n tho\u1ea1i,\u2026<\/p>\n\n\n\n<ul class=\"has-medium-font-size\"><li>Nhi\u1ec1u thi\u1ebft b\u1ecb \u0111i\u1ec7n t\u1eed \u0111\u01b0\u1ee3c \u0111i\u1ec1u h\u00e0nh b\u1edfi ch\u01b0\u01a1ng tr\u00ecnh v\u00e0 c\u00f3 m\u00e1y t\u00ednh c\u00e0i s\u1eb5n b\u00ean trong.&nbsp; &nbsp;<\/li><\/ul>\n\n\n\n<p class=\"has-medium-font-size\">V\u00ed d\u1ee5: m\u00e1y r\u1eeda b\u00e1t, ti vi, \u0111\u1ed3ng h\u1ed3 th\u00f4ng minh,\u2026<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><strong>Thu\u1eadt to\u00e1n v\u00e0 ch\u01b0\u01a1ng tr\u00ecnh<\/strong><\/p>\n\n\n\n<ul class=\"has-medium-font-size\"><li>Thu\u1eadt to\u00e1n l\u00e0 danh s\u00e1ch c\u00e1c b\u01b0\u1edbc \u0111\u01b0\u1ee3c vi\u1ebft theo ng\u00f4n ng\u1eef l\u1eadp tr\u00ecnh \u0111\u1ec3 ho\u00e0n th\u00e0nh m\u1ed9t c\u00f4ng vi\u1ec7c n\u00e0o \u0111\u00f3.<\/li><li>Ch\u01b0\u01a1ng tr\u00ecnh l\u00e0 m\u1ed9t t\u1eadp h\u1ee3p c\u00e1c thu\u1eadt to\u00e1n \u0111\u01b0\u1ee3c d\u1ecbch sang m\u00e3 l\u1ec7nh \u0111\u1ec3 m\u00e1y t\u00ednh c\u00f3 th\u1ec3 hi\u1ec3u \u0111\u01b0\u1ee3c m\u00e3. C\u00e1c ch\u01b0\u01a1ng tr\u00ecnh c\u00f3 th\u1ec3 r\u1ea5t ph\u1ee9c t\u1ea1p nh\u01b0 Itunes, Chrome, Safari ho\u1eb7c c\u0169ng c\u00f3 th\u1ec3 v\u00f4 c\u00f9ng \u0111\u01a1n gi\u1ea3n nh\u01b0 m\u1ed9t ch\u01b0\u01a1ng tr\u00ecnh in ra d\u00f2ng ch\u1eef: \u201cXin ch\u00e0o th\u1ebf gi\u1edbi\u201d.<\/li><\/ul>\n\n\n\n<p class=\"has-medium-font-size\"><strong>D\u1eef li\u1ec7u v\u00e0 ph\u00e2n t\u00edch<\/strong><\/p>\n\n\n\n<ul class=\"has-medium-font-size\"><li>D\u1eef li\u1ec7u: th\u00f4 v\u00e0 kh\u00f4ng c\u00f3 t\u1ed5 ch\u1ee9c<\/li><li>Ph\u00e2n t\u00edch: t\u1ed5 ch\u1ee9c, m\u00f4 t\u1ea3, v\u00e0 hi\u1ec3u d\u1eef li\u1ec7u<\/li><li>D\u1eef li\u1ec7u v\u00e0 ph\u00e2n t\u00edch li\u00ean quan \u0111\u1ebfn thu th\u1eadp, l\u01b0u tr\u1eef, t\u1ed5 ch\u1ee9c v\u00e0 nghi\u00ean c\u1ee9u \u0111\u1ec3 gi\u00fap ch\u00fang ta hi\u1ec3u h\u01a1n v\u1ec1 s\u1ed1 li\u1ec7u. Ch\u1eb3ng h\u1ea1n, c\u00f4ng ty thu th\u1eadp d\u1eef li\u1ec7u v\u1ec1 s\u1ea3n ph\u1ea9m kh\u00e1ch h\u00e0ng mua nhi\u1ec1u r\u1ed3i t\u1eeb \u0111\u00f3 c\u00f3 \u0111\u1ecbnh h\u01b0\u1edbng s\u1ea3n xu\u1ea5t m\u1eb7t h\u00e0ng \u0111\u00f3 nhi\u1ec1u h\u01a1n \u0111\u1ec3 thu l\u1eddi.<\/li><\/ul>\n\n\n\n<p class=\"has-medium-font-size\"><strong>M\u1ea1ng l\u01b0\u1edbi v\u00e0 Internet<\/strong><\/p>\n\n\n\n<ul class=\"has-medium-font-size\"><li>M\u1ea1ng l\u00e0 m\u1ed9t nh\u00f3m c\u00e1c thi\u1ebft b\u1ecb \u0111\u01b0\u1ee3c k\u1ebft n\u1ed1i (nh\u01b0 m\u00e1y t\u00ednh, m\u00e1y t\u00ednh x\u00e1ch tay v\u00e0 m\u00e1y ch\u1ee7). Ch\u00fang chia s\u1ebb th\u00f4ng tin, v\u00e0 c\u0169ng c\u00f3 th\u1ec3 chia s\u1ebb t\u00e0i nguy\u00ean.<\/li><li>Internet l\u00e0 m\u1ea1ng l\u01b0\u1edbi to\u00e0n c\u1ea7u k\u1ebft n\u1ed1i h\u00e0ng tri\u1ec7u m\u00e1y t\u00ednh v\u1edbi nhau. M\u1ed9t ph\u1ea7n c\u1ee7a nghi\u00ean c\u1ee9u m\u1ea1ng l\u01b0\u1edbi v\u00e0 internet l\u00e0 t\u00ecm ra c\u00e1ch t\u1ed1t h\u01a1n v\u00e0 an to\u00e0n h\u01a1n trong vi\u1ec7c chia s\u1ebb th\u00f4ng tin tr\u00ean c\u00e1c thi\u1ebft b\u1ecb.<\/li><\/ul>\n\n\n\n<p class=\"has-medium-font-size\"><strong>\u1ea2nh h\u01b0\u1edfng c\u1ee7a m\u00e1y t\u00ednh<\/strong><\/p>\n\n\n\n<ul class=\"has-medium-font-size\"><li>Hi\u1ec3u \u0111\u01b0\u1ee3c \u1ea3nh h\u01b0\u1edfng c\u1ee7a m\u00e1y t\u00ednh l\u00e0 li\u00ean quan \u0111\u1ebfn nghi\u00ean c\u1ee9u c\u00e1ch m\u00e1y t\u00ednh \u1ea3nh h\u01b0\u1edfng \u0111\u1ebfn cu\u1ed9c s\u1ed1ng, v\u0103n ho\u00e1, lu\u1eadt ph\u00e1p hay h\u00e0nh vi.<\/li><li>Khi t\u1ea1o ra m\u1ed9t c\u00f4ng ngh\u1ec7 m\u1edbi, ch\u00fang ta c\u1ea7n ph\u1ea3i t\u1ef1 \u0111\u1eb7t c\u00e2u h\u1ecfi l\u00e0 n\u00f3 \u1ea3nh h\u01b0\u1edfng nh\u01b0 th\u1ebf n\u00e0o? Ch\u1eb3ng h\u1ea1n, ch\u00fang ta t\u1ea1o ra ch\u01b0\u01a1ng tr\u00ecnh c\u00f3 th\u1ec3 hack t\u00e0i kho\u1ea3n ng\u01b0\u1eddi kh\u00e1c v\u00e0 l\u1ea5y th\u00f4ng tin c\u1ee7a ng\u01b0\u1eddi kh\u00e1c, v\u1eady vi\u1ec7c ch\u00fang ta t\u1ea1o ra ch\u01b0\u01a1ng tr\u00ecnh \u0111\u00f3 c\u00f3 \u00edch g\u00ec??? C\u00e2u tr\u1ea3 l\u1eddi l\u00e0 kh\u00f4ng. Ch\u00ednh v\u00ec th\u1ebf, khi mu\u1ed1n t\u1ea1o ra c\u00e1i g\u00ec m\u1edbi, ch\u00fang ta c\u1ea7n ph\u1ea3i suy ngh\u0129 \u0111\u1ebfn nh\u1eefng \u1ea3nh h\u01b0\u1edfng m\u00e0 ch\u00fang c\u00f3 th\u1ec3 mang l\u1ea1i.<\/li><\/ul>\n\n\n\n<p class=\"has-text-align-center has-medium-font-size\">\u201cTechnology is the best when it brings people together\u201d<\/p>\n\n\n\n<p class=\"has-text-align-center has-medium-font-size\"><strong>Matt Mullenweg<\/strong><\/p>\n\n\n\n<p class=\"has-medium-font-size\">The PAS Project \u2013 Awaken your dream<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ng\u00e0nh khoa h\u1ecdc m\u00e1y t\u00ednh c\u00f3 th\u1ec3 chia th\u00e0nh 5 lo\u1ea1i v\u00f9ng kh\u00e1i ni\u1ec7m (ph\u1ea7n ch\u00ednh) c\u1ee7a ng\u00e0nh h\u1ecdc: H\u1ec7<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[16],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/posts\/322"}],"collection":[{"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/comments?post=322"}],"version-history":[{"count":3,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/posts\/322\/revisions"}],"predecessor-version":[{"id":384,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/posts\/322\/revisions\/384"}],"wp:attachment":[{"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/media?parent=322"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/categories?post=322"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/tags?post=322"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}