{"id":385,"date":"2022-02-27T12:32:19","date_gmt":"2022-02-27T12:32:19","guid":{"rendered":"http:\/\/localhost\/pas\/?p=385"},"modified":"2022-04-23T14:16:04","modified_gmt":"2022-04-23T07:16:04","slug":"lich-su-ra-doi-cua-may-tinh-phan-1","status":"publish","type":"post","link":"http:\/\/localhost\/pas\/2022\/02\/27\/lich-su-ra-doi-cua-may-tinh-phan-1\/","title":{"rendered":"L\u1ecaCH S\u1eec RA \u0110\u1edcI C\u1ee6A M\u00c1Y T\u00cdNH (PH\u1ea6N\u00a01)"},"content":{"rendered":"\n<p class=\"has-large-font-size\"><strong><em>L\u1ecbch s\u1eed m\u00e1y t\u00ednh v\u00e0 nh\u1eefng \u0111i\u1ec1u ch\u01b0a bi\u1ebft?<\/em><\/strong><\/p>\n\n\n\n<p class=\"has-drop-cap has-medium-font-size\">C\u00f3 l\u1ebd l\u00e0 tr\u00ean tr\u01b0\u1eddng l\u1edbp th\u00ec ch\u1eafc c\u00e1c b\u1ea1n c\u0169ng \u0111\u00e3 m\u1ed9t l\u1ea7n t\u1eebng nghe ngu\u1ed3n g\u1ed1c v\u00e0 s\u1ef1 h\u00ecnh th\u00e0nh ph\u00e1t tri\u1ec3n c\u1ee7a m\u00e1y t\u00ednh. V\u00ed d\u1ee5 nh\u01b0 l\u00e0 m\u00e1y t\u00ednh ban \u0111\u1ea7u th\u00ec h\u00ecnh d\u00e1ng c\u1ee7a n\u00f3 to b\u1eb1ng c\u1ea3 c\u0103n ph\u00f2ng hay l\u00e0 do n\u01b0\u1edbc n\u00e0o ph\u00e1t tri\u1ec3n? B\u00e0i vi\u1ebft d\u01b0\u1edbi \u0111\u00e2y s\u1ebd cung c\u1ea5p m\u1ed9t s\u1ed1 th\u00f4ng tin c\u1ee5 th\u1ec3 h\u01a1n v\u1ec1 l\u1ecbch s\u1eed c\u1ee7a m\u00e1y t\u00ednh t\u1eeb khi n\u00f3 c\u00f2n l\u00e0 m\u1ed9t \u00fd t\u01b0\u1edfng.<\/p>\n\n\n\n<p class=\"has-medium-font-size\"><a href=\"https:\/\/vi.wikipedia.org\/wiki\/Charles_Babbage\">Charles Babbage<\/a>&nbsp;\u0111\u01b0\u1ee3c bi\u1ebft \u0111\u1ebfn v\u1edbi danh x\u01b0ng \u201ccha \u0111\u1ebb c\u1ee7a m\u00e1y t\u00ednh\u201d, \u00f4ng l\u00e0 m\u1ed9t to\u00e1n h\u1ecdc v\u00e0 l\u00e0 m\u1ed9t k\u1ef9 s\u01b0 c\u01a1 kh\u00ed ng\u01b0\u1eddi Anh, \u0111\u1ed3ng th\u1eddi c\u0169ng l\u00e0 ng\u01b0\u1eddi \u0111\u00e3 l\u00ean \u00fd t\u01b0\u1edfng ph\u00e1t minh ra chi\u1ebfc m\u00e1y t\u00ednh c\u01a1 h\u1ecdc \u0111\u1ea7u ti\u00ean v\u00e0o nh\u1eefng \u0111\u1ea7u th\u1ebf k\u1ec9 19.<\/p>\n\n\n\n<p class=\"has-medium-font-size\">N\u0103m 1821,&nbsp;<a href=\"https:\/\/vi.wikipedia.org\/wiki\/Charles_Babbage\">Babbage<\/a>&nbsp;n\u1ea3y ra m\u1ed9t s\u00e1ng ki\u1ebfn \u0111\u00f3 l\u00e0 ch\u1ebf t\u1ea1o m\u1ed9t m\u00e1y t\u00ednh m\u00e0 s\u1eed d\u1ee5ng \u0111\u1ed9ng c\u01a1 h\u01a1i n\u01b0\u1edbc m\u00e0 n\u00f3 c\u00f3 th\u1ec3 t\u00ednh b\u1ea3ng s\u1ed1 li\u1ec7u. D\u1ef1 \u00e1n n\u00e0y t\u00ean l\u00e0 \u201cDifference engine\u201d(m\u1ed9t m\u00e1y t\u00ednh t\u1ef1 \u0111\u1ed9ng t\u00ednh to\u00e1n v\u00e0 \u0111\u01b0\u1ee3c thi\u1ebft k\u1ebf \u0111\u1ec3 l\u1eadp nh\u1eefng b\u1ea3ng c\u00f3 ch\u1ee9a \u0111a th\u1ee9c), d\u1ef1 \u00e1n \u0111\u1ed3ng th\u1eddi c\u0169ng \u0111\u01b0\u1ee3c t\u00e0i tr\u1ee3 b\u1edfi ch\u00ednh ph\u1ee7 Anh. Nh\u01b0ng n\u00f3 \u0111\u00e3 ch\u00f3ng \u0111\u1ed1i m\u1eb7t v\u1edbi th\u1ea5t b\u1ea1i b\u1edfi v\u00ec s\u1ef1 thi\u1ebfu h\u1ecdc v\u1ec1 c\u00f4ng ngh\u1ec7 \u1edf th\u1eddi \u0111i\u1ec3m \u0111\u00f3.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/pasprojecttk2021.files.wordpress.com\/2022\/01\/270014928_115778804295786_3156040832681303862_n-2.jpg?w=724\" alt=\"\"\/><\/figure><\/div>\n\n\n\n<p class=\"has-medium-font-size\">N\u0103m 1848,&nbsp;<a href=\"https:\/\/vi.wikipedia.org\/wiki\/Ada_Lovelace\">Ada Lovelace<\/a>&nbsp;m\u1ed9t nh\u00e0 to\u00e1n h\u1ecdc ng\u01b0\u1eddi Anh vi\u1ebft ra ch\u01b0\u01a1ng tr\u00ecnh m\u00e1y t\u00ednh \u0111\u1ea7u ti\u00ean tr\u00ean th\u1ebf gi\u1edbi. T\u01b0\u1eddng thu\u1eadt l\u1ea1i theo Anna Sifert m\u1ed9t gi\u00e1o s\u01b0 c\u1ee7a b\u1ed9 m\u00f4n to\u00e1n l\u00fd thuy\u1ebft th\u00ec Lovelace vi\u1ebft c\u00e1i ch\u01b0\u01a1ng tr\u00ecnh n\u00e0y trong khi \u0111ang d\u1ecbch t\u00e0i li\u1ec7u c\u1ee7a \u00f4ng Babbage t\u1eeb ti\u1ebfng Ph\u00e1p sang ti\u1ebfng anh. B\u00e0 Lovelace c\u00f2n ghi th\u00eam nh\u1eefng gi\u1ea3i th\u00edch c\u1eb7n k\u1ebb v\u1ec1 vi\u1ec7t t\u00ednh to\u00e1n nh\u1eefng s\u1ed1 Bernoulli(m\u1ed9t d\u1ea3y s\u1ed1 h\u1eedu t\u1ec9 li\u00ean ti\u1ebfp nhau)&nbsp; cho&nbsp; cho m\u00e1y t\u00ednh to\u00e1n c\u1ee7a Babbage, c\u00f3 th\u1ec3 n\u00f3i n\u00f4m na th\u00ec \u0111\u00e2y l\u00e0 thu\u1eadt to\u00e1n. \u0110i\u1ec1u n\u1ea3y c\u0169ng v\u00f4 h\u00ecnh chung bi\u1ebfn b\u00e0 Lovelace th\u00e0nh m\u1ed9t nh\u00e0 l\u1eadp tr\u00ecnh m\u00e1y t\u00ednh \u0111\u1ea7u ti\u00ean trong l\u1ecbch s\u1eed.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/pasprojecttk2021.files.wordpress.com\/2022\/01\/270305291_115778807629119_2291932902313438170_n-2.jpg?w=724\" alt=\"\"\/><\/figure><\/div>\n\n\n\n<p class=\"has-medium-font-size\">N\u0103m 1853, nh\u00e0 s\u00e1ng ch\u1ebf ng\u01b0\u1eddi Th\u1ee5y \u0110i\u1ec3n,&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Per_Georg_Scheutz\">Per Georg Scheutz<\/a>, l\u00e0 ng\u01b0\u1eddi \u0111\u1ea7u ti\u00ean ch\u1ebf t\u1ea1o ra \u0111\u01b0\u1ee3c m\u00e1y t\u00ednh m\u00e0 t\u00ednh to\u00e1n xong r\u1ed3i in \u0111\u01b0\u1ee3c ra k\u1ebft qu\u1ea3.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/pasprojecttk2021.files.wordpress.com\/2022\/01\/269906395_115778830962450_8658621426694980162_n-2.jpg?w=724\" alt=\"\"\/><\/figure><\/div>\n\n\n\n<p class=\"has-medium-font-size\">N\u0103m 1890,&nbsp;<a href=\"https:\/\/vi.wikipedia.org\/wiki\/Herman_Hollerith\">Herman Hollerith<\/a>&nbsp;thi\u1ebft k\u1ebf m\u1ed9t h\u1ec7 th\u1ed1ng th\u1ebb \u0111\u1ee5c l\u1ed5 (l\u00e0 th\u1ebb m\u00e0 \u0111\u01b0\u1ee3c \u0111\u1ee5c nh\u1eefng l\u1ed5 \u1edf nh\u1eefng v\u1ecb tr\u00ed cho s\u1eb5n theo tr\u00ecnh t\u1ef1 \u0111\u1ec3 bi\u1ec3u di\u1ec3n cho m\u1ed9t d\u1eef li\u1ec7u n\u00e0o \u0111\u00f3) cho vi\u1ec7c \u0111i\u1ec1u tra d\u00e2n s\u1ed1 n\u0103m 1890. Chi\u1ebfc m\u00e1y n\u00e0y \u0111\u00e3 ti\u1ebft ki\u1ec7m \u0111\u01b0\u1ee3c cho ch\u00ednh ph\u1ee7 5 tri\u1ec7u \u0111\u00f4 v\u00e0 v\u00e0i n\u0103m so v\u1edbi c\u00e1ch l\u00e0m th\u00f4ng th\u01b0\u1eddng. \u00d4ng v\u1ec1 sau c\u0169ng th\u00e0nh l\u1eadp ra c\u00f4ng ty v\u00e0 c\u0169ng l\u00e0 ti\u1ec1n th\u00e2n c\u1ee7a t\u1eadp \u0111o\u00e0n IBM (Internaltional Business Machine Coroperation) ng\u00e0y nay.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img src=\"https:\/\/pasprojecttk2021.files.wordpress.com\/2022\/01\/270225364_115778870962446_5201263941165604271_n-2.jpg?w=724\" alt=\"\"\/><\/figure><\/div>\n\n\n\n<p class=\"has-medium-font-size\">The PAS Project \u2013 Awaken your dream<\/p>\n","protected":false},"excerpt":{"rendered":"<p>L\u1ecbch s\u1eed m\u00e1y t\u00ednh v\u00e0 nh\u1eefng \u0111i\u1ec1u ch\u01b0a bi\u1ebft? C\u00f3 l\u1ebd l\u00e0 tr\u00ean tr\u01b0\u1eddng l\u1edbp th\u00ec ch\u1eafc c\u00e1c b\u1ea1n c\u0169ng<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[17],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/posts\/385"}],"collection":[{"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/comments?post=385"}],"version-history":[{"count":4,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/posts\/385\/revisions"}],"predecessor-version":[{"id":834,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/posts\/385\/revisions\/834"}],"wp:attachment":[{"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/media?parent=385"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/categories?post=385"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/tags?post=385"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}