{"id":528,"date":"2022-03-01T22:05:40","date_gmt":"2022-03-01T15:05:40","guid":{"rendered":"http:\/\/localhost\/pas\/?p=528"},"modified":"2022-03-01T22:12:44","modified_gmt":"2022-03-01T15:12:44","slug":"big-data-va-nghe-data-scientist","status":"publish","type":"post","link":"http:\/\/localhost\/pas\/2022\/03\/01\/big-data-va-nghe-data-scientist\/","title":{"rendered":"Big Data v\u00e0 ngh\u1ec1 Data Scientist"},"content":{"rendered":"\n<p class=\"has-vivid-red-color has-text-color has-large-font-size\"><strong>Fun fact v\u1ec1 ng\u00e0nh Big Data<\/strong><\/p>\n\n\n\n<p class=\"has-vivid-red-color has-text-color has-medium-font-size\">Big Data l\u00e0 g\u00ec?<\/p>\n\n\n\n<p class=\"has-drop-cap has-medium-font-size\">Big Data l\u00e0 t\u1eadp h\u1ee3p d\u1eef li\u1ec7u l\u1edbn (c\u1ea5u tr\u00fac, n\u1eeda c\u1ea5u tr\u00fac v\u00e0 phi c\u1ea5u tr\u00fac), \u0111a d\u1ea1ng, thay \u0111\u1ed5i nhanh v\u00e0 ph\u1ee9c t\u1ea1p \u0111\u1ebfn n\u1ed7i nh\u1eefng c\u00f4ng ngh\u1ec7 hay ph\u1ea7n m\u1ec1m truy\u1ec1n th\u1ed1ng kh\u00f4ng c\u00f3 kh\u1ea3 n\u0103ng x\u1eed l\u00fd trong m\u1ed9t kho\u1ea3ng th\u1eddi gian nh\u1ea5t \u0111\u1ecbnh. Tuy nhi\u00ean, Big Data kh\u00f4ng c\u00f3 \u0111\u1ecbnh ngh\u0129a duy nh\u1ea5t. Ch\u1eb3ng h\u1ea1n, IBM (International Business Machines Corporation) \u0111\u1ecbnh ngh\u0129a Big Data b\u1eb1ng 4 ch\u1eef V, bao g\u1ed3m: <\/p>\n\n\n\n<ul class=\"has-medium-font-size\"><li><strong>Volume:<\/strong>&nbsp;Kh\u1ed1i l\u01b0\u1ee3ng d\u1eef li\u1ec7u<\/li><li><strong>Velocity:<\/strong>&nbsp;T\u1ed1c \u0111\u1ed9 c\u1ee7a d\u1eef li\u1ec7u<\/li><li><strong>Variety:<\/strong>&nbsp;S\u1ef1 \u0111a d\u1ea1ng c\u1ee7a d\u1eef li\u1ec7u<\/li><li><strong>Veracity:<\/strong>&nbsp;T\u00ednh x\u00e1c th\u1ef1c c\u1ee7a d\u1eef li\u1ec7u<\/li><\/ul>\n\n\n\n<p class=\"has-medium-font-size\">Kh\u1ed1i l\u01b0\u1ee3ng ch\u00ednh x\u00e1c c\u1ee7a Big Data kh\u00f4ng ph\u1ea3i l\u00e0 v\u1ea5n \u0111\u1ec1 quan tr\u1ecdng (c\u00f3 th\u1ec3 l\u00e0 v\u00e0i petabyte ho\u1eb7c exabyte), nh\u01b0ng n\u1ebfu bi\u1ebft khai th\u00e1c \u0111\u00fang h\u01b0\u1edbng th\u00ec Big Data s\u1ebd mang l\u1ea1i ti\u1ec1m l\u1ef1c c\u1ea3nh tranh l\u1edbn cho doanh nghi\u1ec7p. <\/p>\n\n\n\n<p class=\"has-medium-font-size\">Hi\u1ec7n nay, Big Data kh\u00f4ng ch\u1ec9 l\u00e0 s\u1ef1 c\u1ea7n thi\u1ebft n\u1eefa m\u00e0 \u0111\u00e3 l\u00e0 &#8220;x\u01b0\u01a1ng s\u1ed1ng&#8221; c\u1ee7a h\u1ea7u h\u1ebft c\u00e1c c\u00f4ng ty c\u00f4ng ngh\u1ec7. V\u00ed d\u1ee5: m\u1ed7i s\u1ea3n ph\u1ea9m c\u00f3 m\u1eb7t tr\u00ean c\u00e1c website th\u01b0\u01a1ng m\u1ea1i \u0111i\u1ec7n t\u1eed nh\u01b0 Tiki, Lazada, Sendo,&#8230; \u0111\u1ec1u l\u00e0 Big Data.<\/p>\n\n\n\n<p class=\"has-medium-font-size\">C\u00e1c c\u00f4ng ty truy\u1ec1n th\u1ed1ng c\u0169ng d\u00f9ng Big Data \u0111\u1ec3 t\u1ed1i \u01b0u ho\u1ea1t \u0111\u00f4ng kinh doanh, ch\u0103m s\u00f3c kh\u00e1ch h\u00e0ng, ph\u1ee5c v\u1ee5 cho c\u00f4ng t\u00e1c Marketing,&#8230;<\/p>\n\n\n\n<p class=\"has-vivid-red-color has-text-color has-medium-font-size\">Nh\u1eefng kh\u00f3 kh\u0103n khi l\u00e0m vi\u1ec7c v\u1edbi Big Data l\u00e0 g\u00ec?<\/p>\n\n\n\n<p class=\"has-medium-font-size\">Khi l\u00e0m vi\u1ec7c v\u1edbi Big Data, nh\u1eefng kh\u00f3 kh\u0103n l\u1edbn c\u00f3 th\u1ec3 ph\u1ea3i g\u1eb7p: <\/p>\n\n\n\n<ul class=\"has-medium-font-size\"><li><strong>Ch\u1ea5t l\u01b0\u1ee3ng d\u1eef li\u1ec7u kh\u00f4ng \u0111\u01b0\u1ee3c \u0111\u1ea3m b\u1ea3o<\/strong><\/li><\/ul>\n\n\n\n<p class=\"has-text-align-center has-medium-font-size\">Trong qu\u00e1 tr\u00ecnh l\u00e0m vi\u1ec7c v\u1edbi Big Data, giai \u0111o\u1ea1n thu nh\u1eadp v\u00e0 x\u1eed l\u00fd d\u1eef li\u1ec7u l\u00e0 ph\u1ea9n vi\u1ec7c t\u1ed1n nhi\u1ec1u th\u1eddi gian v\u00e0 c\u00f4ng s\u1ee9c nh\u1ea5t. Q\u00faa tr\u00ecnh \u0111\u00f3 c\u1ea7n s\u1ef1 h\u1ee3p t\u00e1c c\u1ee7a r\u1ea5t nhi\u1ec1u b\u1ed9 ph\u1eadn kh\u00e1c nhau d\u1eabn \u0111\u1ebfn c\u00e1c ngu\u1ed3n d\u1eef li\u1ec7u kh\u00f4ng nh\u1ea5t qu\u00e1n v\u00e0 ch\u1ea5t l\u01b0\u1ee3ng d\u1eef li\u1ec7u kh\u00f4ng t\u1ed1t. <\/p>\n\n\n\n<ul class=\"has-medium-font-size\"><li><strong>K\u1ebft qu\u1ea3 tri\u1ec3n khai kh\u00f4ng nh\u01b0 \u00fd<\/strong><\/li><\/ul>\n\n\n\n<p class=\"has-text-align-center has-medium-font-size\">Sai l\u1ea7m d\u1ec5 m\u1eafc ph\u1ea3i nh\u1ea5t ch\u00ednh l\u00e0 \u0111\u00e1nh gi\u00e1 v\u00e0 tri\u1ec3n khai k\u1ebft qu\u1ea3 d\u1ef1a tr\u00ean d\u1eef li\u1ec7u \u0111\u00e3 thu th\u1eadp v\u00e0 x\u1eed l\u00fd. Nhi\u1ec1u khi d\u00e2n k\u1ef9 thu\u1eadt th\u01b0\u1eddng \u0111\u1eb7t ra c\u00e1c ti\u00eau ch\u00ed theo l\u00fd thuy\u1ebft ho\u1eb7c theo c\u00e1c case study c\u00f3 s\u1eb5n nh\u01b0ng n\u00f3 l\u1ea1i kh\u00f4ng ph\u00f9 h\u1ee3p v\u1edbi quy tr\u00ecnh kinh doanh th\u1ef1c t\u1ebf.<\/p>\n\n\n\n<p class=\"has-vivid-red-color has-text-color has-large-font-size\"><strong>Ngh\u1ec1 &#8220;l\u00e0m&#8221; Big Data l\u00e0 g\u00ec? L\u00e0 Data Scientist!!!<\/strong><\/p>\n\n\n\n<p class=\"has-vivid-red-color has-text-color has-medium-font-size\">C\u00f4ng vi\u1ec7c h\u1eb1ng ng\u00e0y c\u1ee7a m\u1ed9t Data Scientist<\/p>\n\n\n\n<p class=\"has-medium-font-size\">Nh\u1eefng b\u01b0\u1edbc trong c\u00f4ng vi\u1ec7c h\u1eb1ng ng\u00e0y c\u1ee7a m\u1ed9t Data Scientist: <\/p>\n\n\n\n<ul class=\"has-medium-font-size\"><li>Ph\u00e2n t\u00edch b\u00e0i to\u00e1n c\u1ea7n gi\u1ea3i, m\u1ee5c ti\u00eau d\u1ef1 \u00e1n, ti\u00eau ch\u00ed th\u00e0nh c\u00f4ng\u2026<\/li><li>Thu th\u1eadp v\u00e0 x\u1eed l\u00fd d\u1eef li\u1ec7u<\/li><li>X\u00e2y d\u1ef1ng c\u00e1c m\u00f4 h\u00ecnh, thu\u1eadt to\u00e1n \u0111\u1ec3 \u0111\u01b0a ra k\u1ebft qu\u1ea3<\/li><li>Test, \u0111\u00e1nh gi\u00e1 k\u1ebft qu\u1ea3<\/li><li>\u0110\u01b0a v\u00e0o tri\u1ec3n khai<\/li><\/ul>\n\n\n\n<p class=\"has-medium-font-size\">\u1ede b\u01b0\u1edbc tri\u1ec3n khai, c\u00f4ng ty s\u1ebd d\u00f9ng c\u00e1c k\u1ebft qu\u1ea3, d\u1ef1 \u0111o\u00e1n, \u0111\u1ec1 xu\u1ea5t\u2026 \u0111\u01b0\u1ee3c r\u00fat ra t\u1eeb d\u1eef li\u1ec7u \u0111\u1ec3 \u0111\u01b0a v\u00e0o c\u00e1c ho\u1ea1t \u0111\u1ed9ng kinh doanh, marketing.<\/p>\n\n\n\n<p class=\"has-vivid-red-color has-text-color has-medium-font-size\">Nh\u1eefng k\u1ef9 n\u0103ng c\u1ea7n thi\u1ebft \u0111\u1ec3 tr\u1edf th\u00e0nh Data Scientist<\/p>\n\n\n\n<ul class=\"has-medium-font-size\"><li>K\u1ef9 n\u0103ng \u0111\u1ea7u ti\u00ean m\u00e0 b\u1ea1n c\u1ea7n \u0111\u01b0\u01a1ng nhi\u00ean ph\u1ea3i l\u00e0 l\u1eadp tr\u00ecnh. B\u1ea1n n\u00ean h\u1ecdc ng\u00f4n ng\u1eef l\u1eadp tr\u00ecnh Python<\/li><li>Ngo\u00e0i Python, c\u00f2n c\u00f3&nbsp;SQL, Spark, R ho\u1eb7c c\u00e1c c\u00f4ng c\u1ee5 c\u1ea5p cao h\u01a1n nh\u01b0 l\u00e0 H2O, Tableau<\/li><li>C\u00e1c c\u00f4ng c\u1ee5 c\u1ee7a Data Scientist: Numpy, Pandas, Matplotlib, Scikit-learn<\/li><li>C\u00e1c c\u00f4ng c\u1ee5 Machine Learning: Tensorflow, Keras, Pytorch<\/li><li>Hi\u1ec3u bi\u1ebft nh\u1ea5t \u0111\u1ecbnh v\u1ec1 Big Data, v\u1ec1 c\u00e1c framework nh\u01b0 Hadoop hay Scala<\/li><li>Th\u1ed1ng k\u00ea c\u01a1 b\u1ea3n<\/li><\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Fun fact v\u1ec1 ng\u00e0nh Big Data Big Data l\u00e0 g\u00ec? Big Data l\u00e0 t\u1eadp h\u1ee3p d\u1eef li\u1ec7u l\u1edbn (c\u1ea5u tr\u00fac, n\u1eeda c\u1ea5u tr\u00fac v\u00e0 phi c\u1ea5u tr\u00fac), \u0111a d\u1ea1ng, thay \u0111\u1ed5i nhanh v\u00e0 ph\u1ee9c t\u1ea1p \u0111\u1ebfn n\u1ed7i nh\u1eefng c\u00f4ng ngh\u1ec7 hay ph\u1ea7n m\u1ec1m truy\u1ec1n th\u1ed1ng kh\u00f4ng c\u00f3 kh\u1ea3 n\u0103ng x\u1eed l\u00fd trong m\u1ed9t kho\u1ea3ng th\u1eddi &hellip; <a href=\"http:\/\/localhost\/pas\/2022\/03\/01\/big-data-va-nghe-data-scientist\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Big Data v\u00e0 ngh\u1ec1 Data Scientist<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/posts\/528"}],"collection":[{"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/comments?post=528"}],"version-history":[{"count":2,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/posts\/528\/revisions"}],"predecessor-version":[{"id":535,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/posts\/528\/revisions\/535"}],"wp:attachment":[{"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/media?parent=528"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/categories?post=528"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/tags?post=528"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}