{"id":467,"date":"2022-02-28T08:17:44","date_gmt":"2022-02-28T01:17:44","guid":{"rendered":"http:\/\/localhost\/pas\/?p=467"},"modified":"2022-02-28T10:30:58","modified_gmt":"2022-02-28T03:30:58","slug":"lich-su-ra-doi-cua-may-tinh-phan-2%ef%bf%bc","status":"publish","type":"post","link":"http:\/\/localhost\/pas\/2022\/02\/28\/lich-su-ra-doi-cua-may-tinh-phan-2%ef%bf%bc\/","title":{"rendered":"L\u1ecaCH S\u1eec RA \u0110\u1edcI C\u1ee6A M\u00c1Y T\u00cdNH (PH\u1ea6N\u00a02)\ufffc"},"content":{"rendered":"\n<p class=\"has-x-large-font-size\"><strong><em>Nh\u1eefng s\u00e1ng ch\u1ebf v\u0129 \u0111\u1ea1i<\/em><\/strong><\/p>\n\n\n\n<p class=\"has-drop-cap has-medium-font-size\">Kh\u00e1c bi\u1ec7t v\u1edbi ph\u1ea7n th\u1ee9 1 th\u00ec ph\u1ea7n 2 n\u00e0y s\u1ebd mang \u0111\u1ebfn cho ch\u00fang ta nh\u1eefng th\u00f4ng tin quan tr\u1ecdng c\u00f3 th\u1ec3 khi\u1ebfn l\u00e0 m\u1eaft ch\u1eef A v\u00e0 kh\u1ea9u h\u00ecnh ch\u1eef \u00ca. Ph\u1ea7n n\u00e0y c\u00f3 kh\u1ea3 n\u0103ng \u0111\u01b0\u1ee3c xem nh\u01b0 nh\u1eefng ph\u00e1t minh mang t\u1ea7m c\u00e1ch m\u1ea1ng, \u0111\u1ed3ng th\u1eddi \u0111\u00f3ng vai tr\u00f2 l\u00e0 n\u1ec1n t\u1ea3ng t\u1ea1o n\u00ean c\u1ea5u tr\u00fac v\u00e0 h\u00ecnh h\u00e0i c\u1ee7a m\u00e1y t\u00ednh ng\u00e0y nay.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https:\/\/pasprojecttk2021.files.wordpress.com\/2022\/01\/272351717_121829797024020_7727605745262087404_n-2.jpg?w=830\" alt=\"\"\/><figcaption><strong>William Shockley, John Vincent Atanasoff, Alan Turing v\u00e0 Vannevar Bush (t\u1eeb tr\u00e1i qua ph\u1ea3i)<\/strong><\/figcaption><\/figure>\n\n\n\n<p class=\"has-medium-font-size\">N\u0103m 1931, t\u1ea1i vi\u1ec7n c\u00f4ng ngh\u1ec7 Massachusetts,&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Vannevar_Bush\">Vanneva Bush<\/a>&nbsp;\u0111\u00e3 ph\u00e1t minh v\u00e0 ch\u1ebf t\u1ea1o ra m\u00e1y ph\u00e2n t\u00edch vi sai, m\u00e1y t\u00ednh c\u01a1 h\u1ecdc \u0111a n\u0103ng t\u1ef1 \u0111\u1ed9ng quy m\u00f4 l\u1edbn \u0111\u1ea7u ti\u00ean.<\/p>\n\n\n\n<p class=\"has-medium-font-size\">N\u0103m 1936,&nbsp;<a href=\"https:\/\/vi.wikipedia.org\/wiki\/Alan_Turing\">Alan Turing<\/a>&nbsp;tr\u00ecnh b\u00e0y kh\u00e1i ni\u1ec7m v\u1ec1 m\u1ed9t c\u1ed7 m\u00e1y v\u1ea1n n\u0103ng, sau n\u00e0y g\u1ecdi l\u00e0 m\u00e1y Turing, c\u00f3 kh\u1ea3 n\u0103ng t\u00ednh to\u00e1n b\u1ea5t c\u1ee9 th\u1ee9 g\u00ec c\u00f3 th\u1ec3 t\u00ednh to\u00e1n \u0111\u01b0\u1ee3c. Kh\u00e1i ni\u1ec7m c\u1ed1t l\u00f5i c\u1ee7a m\u00e1y t\u00ednh hi\u1ec7n \u0111\u1ea1i d\u1ef1a tr\u00ean \u00fd t\u01b0\u1edfng n\u00e0y c\u1ee7a \u00f4ng.<\/p>\n\n\n\n<p class=\"has-medium-font-size\">N\u0103m 1937,&nbsp;<a href=\"https:\/\/vi.wikipedia.org\/wiki\/John_Vincent_Atanasoff\">John Vincent Atanasoff<\/a>, gi\u00e1o s\u01b0 v\u1eadt l\u00fd v\u00e0 to\u00e1n h\u1ecdc t\u1ea1i tr\u01b0\u1eddng \u0111\u1ea1i h\u1ecdc Iowa, c\u1ed1 g\u1eafng ch\u1ebf t\u1ea1o chi\u1ebfc m\u00e1y t\u00ednh \u0111\u1ea7u ti\u00ean kh\u00f4ng c\u00f3 b\u00e1nh r\u0103ng, d\u00e2y \u0111ai ho\u1eb7c tr\u1ee5c.<\/p>\n\n\n\n<p class=\"has-medium-font-size\">N\u0103m 1941, Atanasoff v\u00e0 sinh vi\u00ean c\u1ee7a \u00f4ng, Clifford Berry, \u0111\u00e3 thi\u1ebft k\u1ebf m\u1ed9t m\u00e1y t\u00ednh (c\u00f2n \u0111\u01b0\u1ee3c g\u1ecdi l\u00e0 Atanasoff \u2013 Berry Computer) c\u00f3 th\u1ec3 gi\u1ea3i quy\u1ebft 29 ph\u01b0\u01a1ng tr\u00ecnh \u0111\u1ed3ng th\u1eddi. \u0110i\u1ec1u n\u00e0y \u0111\u00e1nh d\u1ea5u s\u1ef1 ki\u1ec7n l\u1ea7n \u0111\u1ea7u ti\u00ean m\u1ed9t m\u00e1y t\u00ednh c\u00f3 th\u1ec3 l\u01b0u tr\u1eef th\u00f4ng tin tr\u00ean b\u00f4 nh\u1edb ch\u00ednh c\u1ee7a n\u00f3 v\u00e0 c\u00f3 kh\u1ea3 n\u0103ng th\u1ef1c hi\u1ec7n m\u1ed9t thao t\u00e1c sau 15 gi\u00e2y.<\/p>\n\n\n\n<p class=\"has-medium-font-size\">N\u0103m 1943 \u2013 1945, hai gi\u00e1o s\u01b0 c\u1ee7a \u0110\u1ea1i h\u1ecdc Pennsylvania,&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/John_Mauchly\">John Mauchly<\/a>&nbsp;v\u00e0&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/J._Presper_Eckert\">J. Presper Eckert<\/a>, \u0111\u00e3 x\u00e2y d\u1ef1ng m\u00e1y t\u00ednh Electronic Numerical Integrator and Calculator (ENIAC). \u0110\u01b0\u1ee3c coi l\u00e0 \u201c\u00f4ng n\u1ed9i\u201d c\u1ee7a m\u00e1y t\u00ednh k\u1ef9 thu\u1eadt s\u1ed1 hi\u1ec7n \u0111\u1ea1i, th\u00e2n h\u00ecnh \u0111\u1ed3 s\u1ed9 c\u1ee7a n\u00f3 chi\u1ebfm h\u1ebft m\u1ed9t c\u0103n ph\u00f2ng v\u1edbi di\u1ec7n t\u00edch 6x12m, g\u1ed3m 40 k\u1ec7 cao 2,4m v\u00e0 c\u00f3 18.000 \u1ed1ng ch\u00e2n kh\u00f4ng. N\u00f3 c\u00f3 kh\u1ea3 n\u0103ng x\u1eed l\u00fd 5.000 ph\u00e9p t\u00ednh\/m\u1ed9t gi\u00e2y v\u00e0 ho\u1ea1t \u0111\u1ed9ng nhanh h\u01a1n b\u1ea5t c\u1ee9 thi\u1ebft b\u1ecb n\u00e0o tr\u01b0\u1edbc \u0111\u00f3.<\/p>\n\n\n\n<p class=\"has-medium-font-size\">N\u0103m 1946, Mauchly v\u00e0 Presper r\u1eddi \u0110\u1ea1i h\u1ecdc Pennsylvania v\u00e0 nh\u1eadn t\u00e0i tr\u1ee3 t\u1eeb C\u1ee5c \u0111i\u1ec1u tra d\u00e2n s\u1ed1 \u0111\u1ec3 x\u00e2y d\u1ef1ng UNIVAC, m\u00e1y t\u00ednh th\u01b0\u01a1ng m\u1ea1i \u0111\u1ea7u ti\u00ean cho c\u00e1c \u1ee9ng d\u1ee5ng kinh doanh v\u00e0 cho ch\u00ednh ph\u1ee7.<\/p>\n\n\n\n<p class=\"has-medium-font-size\">N\u0103m 1947,&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/William_Shockley\">William Shockley<\/a>,&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/John_Bardeen\">John Bardeen<\/a>&nbsp;v\u00e0&nbsp;<a href=\"https:\/\/en.wikipedia.org\/wiki\/Walter_Houser_Brattain\">Walter Brattain<\/a>&nbsp;c\u1ee7a Bell Laboratory (Ph\u00f2ng th\u00ed nghi\u1ec7m Bell) \u0111\u00e3 ph\u00e1t minh ra b\u00f3ng b\u00e1n d\u1eabn. H\u1ecd \u0111\u00e3 ph\u00e1t hi\u1ec7n ra c\u00e1ch ch\u1ebf t\u1ea1o m\u1ed9t c\u00f4ng t\u1eafc \u0111i\u1ec7n b\u1eb1ng v\u1eadt li\u1ec7u r\u1eafn v\u00e0 kh\u00f4ng c\u1ea7n ch\u00e2n kh\u00f4ng.<\/p>\n\n\n\n<p class=\"has-medium-font-size\">N\u0103m 1949, m\u1ed9t nh\u00f3m nghi\u00ean c\u1ee9u t\u1ea1i tr\u01b0\u1eddng \u0111\u1ea1i h\u1ecdc Cambridge \u0111\u00e3 ph\u00e1t tri\u1ec3n m\u00e1y EDSAC (m\u00e1y t\u00ednh t\u1ef1 \u0111\u1ed9ng l\u01b0u tr\u1eef \u0111\u1ed9 tr\u1ec5 \u0111i\u1ec7n t\u1eed), m\u00e1y t\u00ednh th\u1ef1c t\u1ebf c\u00f3 ch\u01b0\u01a1ng tr\u00ecnh l\u01b0u tr\u1eef \u0111\u1ea7u ti\u00ean. EDSAC ch\u1ea1y ch\u01b0\u01a1ng tr\u00ecnh \u0111\u1ea7u ti\u00ean v\u00e0o th\u00e1ng 5\/1949 khi n\u00f3 t\u00ednh to\u00e1n c\u00e1c b\u1ea3ng c\u00e1c s\u1ed1 ch\u00ednh ph\u01b0\u01a1ng v\u00e0 m\u1ed9t d\u00e3y c\u00e1c s\u1ed1 nguy\u00ean t\u1ed1. V\u00e0o th\u00e1ng 11\/1949, c\u00e1c nh\u00e0 khoa h\u1ecdc c\u00f9ng v\u1edbi h\u1ed9i \u0111\u1ed3ng nghi\u00ean c\u1ee9u khoa h\u1ecdc v\u00e0 c\u00f4ng nghi\u1ec7p (CSIR), nay g\u1ecdi l\u00e0 l\u00e0 CSIRO, \u0111\u00e3 ch\u1ebf t\u1ea1o m\u00e1y t\u00ednh k\u1ef9 thu\u1eadt s\u1ed1 \u0111\u1ea7u ti\u00ean c\u1ee7a \u00dac. \u0110\u00e2y l\u00e0 m\u00e1y t\u00ednh k\u0129 thu\u1eadt s\u1ed1 \u0111\u1ea7u ti\u00ean c\u00f3 th\u1ec3 ch\u01a1i nh\u1ea1c.<\/p>\n\n\n\n<p class=\"has-medium-font-size\">The PAS Project \u2013 Awaken your dream<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Nh\u1eefng s\u00e1ng ch\u1ebf v\u0129 \u0111\u1ea1i Kh\u00e1c bi\u1ec7t v\u1edbi ph\u1ea7n th\u1ee9 1 th\u00ec ph\u1ea7n 2 n\u00e0y s\u1ebd mang \u0111\u1ebfn cho ch\u00fang ta nh\u1eefng th\u00f4ng tin quan tr\u1ecdng c\u00f3 th\u1ec3 khi\u1ebfn l\u00e0 m\u1eaft ch\u1eef A v\u00e0 kh\u1ea9u h\u00ecnh ch\u1eef \u00ca. Ph\u1ea7n n\u00e0y c\u00f3 kh\u1ea3 n\u0103ng \u0111\u01b0\u1ee3c xem nh\u01b0 nh\u1eefng ph\u00e1t minh mang t\u1ea7m c\u00e1ch m\u1ea1ng, \u0111\u1ed3ng th\u1eddi &hellip; <a href=\"http:\/\/localhost\/pas\/2022\/02\/28\/lich-su-ra-doi-cua-may-tinh-phan-2%ef%bf%bc\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">L\u1ecaCH S\u1eec RA \u0110\u1edcI C\u1ee6A M\u00c1Y T\u00cdNH (PH\u1ea6N\u00a02)\ufffc<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/posts\/467"}],"collection":[{"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/comments?post=467"}],"version-history":[{"count":2,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/posts\/467\/revisions"}],"predecessor-version":[{"id":496,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/posts\/467\/revisions\/496"}],"wp:attachment":[{"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/media?parent=467"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/categories?post=467"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/pas\/wp-json\/wp\/v2\/tags?post=467"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}